/* メニュー項目とウィンドウタイトル */
"NINE_BOX_VIEW" = "九マスビュー Pro";

/* 参照グリフセクション */
"REFERENCE_INPUT_PLACEHOLDER" = "参照グリフを入力…";
"SAVE_REFERENCE_BUTTON" = "保存";
"SAVE_REFERENCE_TOOLTIP" = "参照プリセットに保存";

/* テーマ切り替えボタン */
"THEME_TOGGLE_LIGHT_TOOLTIP" = "ダークモードに切り替え";
"THEME_TOGGLE_DARK_TOOLTIP" = "ライトモードに切り替え";

/* 参照パネル切り替えボタン */
"REFERENCE_PANEL_SHOW_TOOLTIP" = "参照パネルを表示";
"REFERENCE_PANEL_HIDE_TOOLTIP" = "参照パネルを非表示";

/* 参照ウィンドウタイトル */
"REFERENCE_PANEL_TITLE" = "参照";

/* ロックウィンドウタイトル*/
"LOCKED_PANEL_TITLE" = "ロック";

/* プリセットパネル切り替えボタン*/
"PRESETS_TOGGLE_SHOW_TOOLTIP" = "プリセットパネルを表示";
"PRESETS_TOGGLE_HIDE_TOOLTIP" = "プリセットパネルを隠す";

/* プリセットウィンドウタイトル*/
"PRESETS_WINDOW_TITLE" = "プリセット";

/* ぼかしスライダー */
"BLUR_SLIDER_TOOLTIP" = "ぼかし強度";

/* グリフピッカー */
"GLYPH_PICKER_TITLE_LOCK" = "ロックグリフを選択";
"GLYPH_PICKER_TITLE_REFERENCE" = "参照グリフを選択";

/* コンテキストメニュー（参照テキストビュー） */
"CONTEXT_MENU_GLYPH_PICKER" = "グリフピッカー…";

/* タイトルバーメニューボタン*/
"TITLEBAR_MENU_TOOLTIP" = "メニュー";

/* 情報メニュー*/
"INFO_MENU_HELP" = "使用ガイド";
"INFO_MENU_WEBSITE" = "公式サイト";
"INFO_MENU_FEEDBACK" = "フィードバック…";
"INFO_MENU_CONTACT_US" = "お問い合わせ…";
"INFO_MENU_TESTIMONIAL" = "使用体験を共有…";
"INFO_MENU_PURCHASE" = "購入…";

/* ロック切り替えボタン（メインウィンドウツールバー） */
"LOCK_TOGGLE_ENABLED_TOOLTIP" = "ロックグリフを表示中（Cmd で編集）";
"LOCK_TOGGLE_DISABLED_TOOLTIP" = "ロックグリフを非表示（Cmd で編集）";

/* ロックグリフパネル*/
"CLEAR_LOCKED_BUTTON" = "クリア";
"CLEAR_LOCKED_TOOLTIP" = "すべてのロックを解除";
"SAVE_LOCKED_BUTTON" = "保存";
"SAVE_LOCKED_TOOLTIP" = "ロックプリセットに保存";
"LOCKED_PANEL_TOGGLE_SHOW" = "ロックパネルを表示";
"LOCKED_PANEL_TOGGLE_HIDE" = "ロックパネルを隠す";

/* 参照グリフ入力ダイアログ */
"REFERENCE_INPUT_CANCEL" = "キャンセル";

/* ドラッグヒント */
"Open Grid in New Tab" = "グリッドを新しいタブで開く";

/* ツールバー切り替えボタン */
"TOOLBAR_TOGGLE_HIDE_TOOLTIP" = "ツールバーを隠す";
"TOOLBAR_TOGGLE_SHOW_TOOLTIP" = "ツールバーを表示";

/* ライセンス状態 */
"LICENSE_TRIAL_REMAINING" = "試用期間：残り %ld 日";
"LICENSE_TRIAL_DAYS" = "残り %ld 日";
"LICENSE_ACTIVATED" = "ライセンス所有者：%@";

/* ライセンス入力ダイアログ */
"LICENSE_INPUT_TITLE" = "ライセンスを有効化";
"LICENSE_INPUT_CANCEL" = "キャンセル";
"LICENSE_INPUT_BUY" = "購入…";
"LICENSE_INPUT_CONTACT" = "サポート";

/* ライセンスドロップゾーン */
"LICENSE_DROP_HINT" = ".license ファイルをここにドロップ";
"LICENSE_DROP_ACTIVE" = "放してライセンスを有効化";

/* ライセンスエラーメッセージ */
"LICENSE_ERROR_INVALID_KEY" = "ライセンスキーが無効です。";
"LICENSE_ERROR_INVALID_EMAIL" = "メールアドレスが無効です。";
"LICENSE_ERROR_INVALID_FILE" = "無効なライセンスファイルです。";
"LICENSE_ERROR_WRONG_PRODUCT" = "このライセンスは NineBoxView 用ではありません。";
"LICENSE_ERROR_MISSING_FIELDS" = "ライセンスファイルが不完全です。";
"LICENSE_ERROR_REVOKED" = "このライセンスキーは取り消されました。";
"LICENSE_VERIFYING" = "ライセンスを確認中...";

/* ライセンス有効化成功 */
"LICENSE_ACTIVATION_SUCCESS_TITLE" = "ライセンス有効化完了";
"LICENSE_ACTIVATION_SUCCESS_OK" = "OK";

/* 試用期間終了画面 */
"LICENSE_EXPIRED_WINDOW_TITLE" = "九マスビュー Pro";
"LICENSE_EXPIRED_TITLE" = "試用期間が終了しました";
"LICENSE_EXPIRED_MESSAGE" = "14日間の試用期間が終了しました。\n九マスビュー Proを引き続きご利用いただくには、ライセンスをご購入ください。";
"LICENSE_EXPIRED_PURCHASE" = "ライセンスを購入";
"LICENSE_EXPIRED_ENTER_KEY" = "ライセンスキーを入力";
"LICENSE_EXPIRED_FREE_VERSION" = "無料版を使用";

/* 情報メニュー*/
"INFO_MENU_ENTER_LICENSE" = "ライセンスを入力…";

/* ようこそダイアログ */
"LICENSE_WELCOME_TITLE" = "九マスビュー Pro へようこそ";
"LICENSE_WELCOME_MESSAGE" = "強力な9マスプレビュー機能を体験して、より良いグリフデザインの決定を行いましょう。\n\n下のボタンをクリックすると、14日間の無料トライアルが始まります。";
"LICENSE_WELCOME_START_TRIAL" = "14日間トライアルを開始";
"LICENSE_WELCOME_ENTER_KEY" = "ライセンスキーを入力";

/* パレットタブ*/
"PALETTE_TAB_REFERENCE" = "参照";
"PALETTE_TAB_LOCKED" = "ロック";

/* パレットコンテキストメニュー*/
"PALETTE_MENU_PIN" = "ピン留め";
"PALETTE_MENU_UNPIN" = "ピン留め解除";
"PALETTE_MENU_RENAME" = "名前を変更…";
"PALETTE_MENU_OVERWRITE" = "現在の内容で置換";
"PALETTE_MENU_DELETE" = "消去";

/* パレットコンテキストメニュー - 複数選択*/
"PALETTE_MENU_DELETE_MULTIPLE" = "%lu 件を消去";
"PALETTE_MENU_PIN_MULTIPLE" = "%lu 件をピン留め";
"PALETTE_MENU_UNPIN_MULTIPLE" = "%lu 件のピン留め解除";

/* パレット空状態*/
"PALETTE_EMPTY_REFERENCE" = "参照プリセットなし\n+ で追加";
"PALETTE_EMPTY_LOCKED" = "ロックプリセットなし\n+ で追加";

/* パレット上書き確認*/
"PALETTE_OVERWRITE_CONFIRM_TITLE" = "上書きの確認";
"PALETTE_OVERWRITE_CONFIRM_MESSAGE" = "プリセットの内容が置き換えられます。この操作は元に戻せません。";
"PALETTE_OVERWRITE_CONFIRM_OK" = "上書き";

/* グリッドビューコンテキストメニュー*/
"CONTEXT_MENU_SHOW_REFERENCE_INPUT" = "参照パネルを表示";
"CONTEXT_MENU_HIDE_REFERENCE_INPUT" = "参照パネルを隠す";
"CONTEXT_MENU_SHOW_LOCKED_PANEL" = "ロックパネルを表示";
"CONTEXT_MENU_HIDE_LOCKED_PANEL" = "ロックパネルを隠す";
"CONTEXT_MENU_SHOW_PRESETS" = "プリセットパネルを表示";
"CONTEXT_MENU_HIDE_PRESETS" = "プリセットパネルを隠す";
"CONTEXT_MENU_SHOW_TOOLBAR" = "ツールバーを表示";
"CONTEXT_MENU_HIDE_TOOLBAR" = "ツールバーを隠す";
"CONTEXT_MENU_LIGHT_MODE" = "ライトモード";
"CONTEXT_MENU_DARK_MODE" = "ダークモード";
/* グリッド（Issue #422） */
"CONTEXT_MENU_SHOW_GRID_LINES" = "グリッドを表示";
"CONTEXT_MENU_HIDE_GRID_LINES" = "グリッドを隠す";
"CONTEXT_MENU_GRID_STYLE" = "グリッドスタイル";
"GRID_STYLE_FIELD" = "十字マス";
"GRID_STYLE_ASTERISK" = "対角線マス";
"GRID_STYLE_HASH" = "三分割マス";
/* グリッドツールバーボタン（Option+クリック：設定）*/
"GRID_TOGGLE_SHOW_TOOLTIP" = "グリッドを表示（Option：設定）";
"GRID_TOGGLE_HIDE_TOOLTIP" = "グリッドを隠す（Option：設定）";
/* 字面枠（Issue #435）*/
"CONTEXT_MENU_SHOW_COUNTER_FRAME" = "実ボディを表示";
"CONTEXT_MENU_HIDE_COUNTER_FRAME" = "実ボディを隠す";
"CONTEXT_MENU_GRID_SETTINGS" = "グリッド設定…";
"GRID_STYLE_LABEL" = "スタイル";
"COUNTER_FRAME_LABEL" = "実ボディ";

/* グリッドビューコンテキストメニュー - グリフ操作*/
"CONTEXT_MENU_INSERT_AT_CURSOR" = "カーソル位置に挿入";
"CONTEXT_MENU_OPEN_IN_NEW_TAB" = "新規タブで開く";

/* 読み込み/出力メニュー*/
"PRESETS_MENU_IMPORT" = "読み込み…";
"PRESETS_MENU_EXPORT_SELECTED" = "選択項目を出力…";
"PRESETS_MENU_EXPORT_ALL" = "すべてを出力…";

/* 読み込みモードダイアログ*/
"PRESETS_IMPORT_MODE_TITLE" = "プリセットを読み込む";
"PRESETS_IMPORT_MODE_MESSAGE" = "%lu 個のプリセットが見つかりました。どのように読み込みますか？";
"PRESETS_IMPORT_MODE_APPEND" = "追加";
"PRESETS_IMPORT_MODE_REPLACE" = "すべて置き換え";

/* 読み込みエラー*/
"PRESETS_IMPORT_ERROR_TITLE" = "読み込み失敗";
"PRESETS_IMPORT_ERROR_INVALID_FORMAT" = "ファイル形式が無効です。";
"PRESETS_IMPORT_ERROR_UNSUPPORTED_VERSION" = "このファイルは新しいバージョンで作成されました。プラグインを更新してください。";
"PRESETS_IMPORT_ERROR_TYPE_MISMATCH" = "このファイルには%@プリセットが含まれていますが、現在%@タブにいます。";
"PRESETS_IMPORT_ERROR_EMPTY" = "このファイルには有効なプリセットがありません。";

/* 出力エラー*/
"PRESETS_EXPORT_ERROR_TITLE" = "出力失敗";
"PRESETS_EXPORT_ERROR_MESSAGE" = "ファイルを保存できませんでした：%@";

/* 種類名*/
"PRESETS_TYPE_REFERENCE" = "参照";
"PRESETS_TYPE_LOCKED" = "ロック";

/* 検索フィールド placeholder*/
"SEARCH_PRESETS_PLACEHOLDER" = "プリセットを検索…";
"SEARCH_NO_RESULTS" = "結果なし";

/* 並べ替えオプション*/
"SORT_NAME_AZ" = "名前 A → Z";
"SORT_NAME_ZA" = "名前 Z → A";
"SORT_DATE_NEWEST" = "追加日（新しい順）";
"SORT_DATE_OLDEST" = "追加日（古い順）";

/* 並べ替えボタンツールチップ*/
"SORT_BUTTON_TOOLTIP" = "並べ替え";

/* 「詳細」パネル*/
"ABOUT_MENU_ITEM" = "九マスビュー Pro について…";
"ABOUT_WINDOW_TITLE" = "情報";
"ABOUT_LICENSED_TO" = "ライセンス所有者：";
"ABOUT_LINK_WEBSITE" = "公式サイト";
"ABOUT_LINK_HELP" = "使用ガイド";
"ABOUT_TRIAL_STATUS" = "試用中";
"ABOUT_TRIAL_EXPIRED" = "試用期間終了";
"ABOUT_STATUS_LICENSED" = "ライセンス認証済み";
"ABOUT_STATUS_UNLICENSED" = "未認証";

/* ライセンス解除*/
"ABOUT_DEACTIVATE_LICENSE" = "ライセンスを解除";
"ABOUT_DEACTIVATE_CONFIRM_TITLE" = "ライセンスを解除しますか？";
"ABOUT_DEACTIVATE_CONFIRM_MESSAGE" = "このコンピュータからライセンス情報が削除されます。ライセンスキーでいつでも再認証できます。";
"ABOUT_DEACTIVATE_CONFIRM_OK" = "解除";
"ABOUT_DEACTIVATE_CONFIRM_CANCEL" = "キャンセル";
